Revit 2027 API
ExportLineweightTable.Remove Method
 Removes the pair (key, info) corresponding to the given ExportLineweightKey.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Remove(
	ExportLineweightKey exportLineweightKey
)
Public Sub Remove (
	exportLineweightKey As ExportLineweightKey
)
public:
void Remove(
	ExportLineweightKey^ exportLineweightKey
)
member Remove :
        exportLineweightKey : ExportLineweightKey -> unit
Parameters
exportLineweightKey ExportLineweightKey
 The export line weight key
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLineweightTable Class
Autodesk.Revit.DB Namespace